archive/before-2018-11-10/2017-07-06-python中的functools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-07-06-python中的functools</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-07-06-python中的functools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge112a19">1. partial</a></li>
<li><a href="#update_wrapper">2. update_wrapper</a></li>
<li><a href="#org36c9a13">3. cmp_to_key</a></li>
<li><a href="#org536d605">4. total_ordering</a></li>
<li><a href="#org493a360">5. wraps</a></li>
<li><a href="#org3f01ecd">6. <span class="todo TODO">TODO</span> partial创建的对象 暂时没有找到合适的例子</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge112a19" class="outline-2">
<h2 id="orge112a19"><span class="section-number-2">1</span> partial</h2>
<div class="outline-text-2" id="text-1">
<p>
我觉得就是给了一些默认参数:
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">import</span> functools

     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add</span>(a, b):
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'[a = %s,b = %s]'</span> % (a, b) 

     add(4, 2)

     <span style="color: #ff8700;">plus3</span> = functools.partial(add, 3)
     <span style="color: #ff8700;">plus5</span> = functools.partial(add, 5)

     <span style="color: #ff8700;">plusplus</span> = functools.partial(add, 5, 8)
     plus3(4)
     plus3(7)
     plus5(10)
     plusplus()

</pre>
</div>

<p>
它的定义应该是像这样：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">partial</span>(func, *args, **keywords):
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">newfunc</span>(*fargs, **fkeywords):
             <span style="color: #ff8700;">newkeywords</span> = keywords.copy()
             newkeywords.update(fkeywords)
             <span style="color: #a1db00;">return</span> func(*(args + fargs), **newkeywords)
         <span style="color: #ff8700;">newfunc.func</span> = func
         <span style="color: #ff8700;">newfunc.args</span> = args
         <span style="color: #ff8700;">newfunc.keywords</span> = keywords
         <span style="color: #a1db00;">return</span> newfunc
</pre>
</div>

<p>
<b>仔细看下下面这个代码的输出就知道它到底对这些函数都做了啥了：</b>
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add</span>(a, b, *args, **kargs):
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'[a = %s,b = %s]'</span> % (a, b) 
         <span style="color: #a1db00;">if</span> args:
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'really add args = {f}'</span>.<span style="color: #d18aff;">format</span>(f=args)

         <span style="color: #a1db00;">if</span> kargs:
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'really add kargs = %s'</span> % kargs

     add(4, 2)

     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">my_partial</span>(func, *args, **keywords):
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'in my_partial: args = %s, keywords = %s'</span> % (args, keywords)

         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">newfunc</span>(*fargs, **fkeywords):
             <span style="color: #ff8700;">newkeywords</span> = keywords.copy()
             newkeywords.update(fkeywords)
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'fkeywords in newfunc = %s'</span> % fkeywords
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'fargs in newfunc = {f}'</span>.<span style="color: #d18aff;">format</span>(f=fargs)
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'args in newfunc = {f}'</span>.<span style="color: #d18aff;">format</span>(f=args)
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'keywords in newfunc = {f}'</span>.<span style="color: #d18aff;">format</span>(f=keywords)

             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'[test] input args = {f}'</span>.<span style="color: #d18aff;">format</span>(f=(args + fargs))
             <span style="color: #a1db00;">return</span> func(*(args + fargs), **newkeywords)

         <span style="color: #ff8700;">newfunc.func</span> = func
         <span style="color: #ff8700;">newfunc.args</span> = args

         <span style="color: #ff8700;">newfunc.keywords</span> = keywords
         <span style="color: #a1db00;">return</span> newfunc

     <span style="color: #ff8700;">plus3</span> = my_partial(add, 3, 12, name=<span style="color: #ff4ea3;">'peng'</span>)
     plus3(10, 11, name=<span style="color: #ff4ea3;">'xiepeng'</span>)
</pre>
</div>
<p>
可以看到，通过它装钸过的函数，实际传给它的 <code>*args</code> 是装钸时的和实际
调用的之和，例子中实际传进来的就是 <code>(3, 12, 10, 11)</code> 。给到add函数
时，3和12分别给了a和b参数。剩下才放在 <code>args</code> 中（倒数第二句）。而
<code>**kargs</code> 这种，会在实际调用函数的时候覆盖装钸时的值，其实就是那个
<code>newkeywords.update</code> 做的事情。这里是 <code>{'name': 'peng'}</code> 被
<code>{'name': 'xiepeng'}</code> 替代。
</p>
</div>
</div>

<div id="outline-container-org62aa9cf" class="outline-2">
<h2 id="update_wrapper"><a id="org62aa9cf"></a><span class="section-number-2">2</span> update_wrapper</h2>
<div class="outline-text-2" id="text-update_wrapper">
<p>
默认partial对象没有__name__和__doc__, 这种情况下，对于装饰器函数非
常难以debug.使用update_wrapper(),从原始对象拷贝或加入现有partial对
象。
</p>

<p>
直接使用 wrap ，原来的 hello的 <code>__name__</code> 和 <code>__doc__</code> 被wrap中的
call_it函数覆盖了。wrap2中使用updatea_wrapper，可以把原来的函数的这
两个属性搞回去。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/usr/local/bin/python</span>
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrap</span>(func):
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">call_it</span>(*args, **kwargs):
             <span style="color: #ff4b4b;">"""wrap func: call_it"""</span>
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'before call'</span>
             <span style="color: #a1db00;">return</span> func(*args, **kwargs)
         <span style="color: #a1db00;">return</span> call_it

     <span style="color: #00d7af;">@wrap</span>
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hello</span>():
         <span style="color: #ff4b4b;">"""say hello"""</span>
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'hello world'</span>

     <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> update_wrapper
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrap2</span>(func):
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">call_it</span>(*args, **kwargs):
             <span style="color: #ff4b4b;">"""wrap func: call_it2"""</span>
             <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'before call'</span>
             <span style="color: #a1db00;">return</span> func(*args, **kwargs)
         <span style="color: #a1db00;">return</span> update_wrapper(call_it, func)

     <span style="color: #00d7af;">@wrap2</span>
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">hello2</span>():
         <span style="color: #ff4b4b;">"""test hello"""</span>
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'hello world2'</span>

     <span style="color: #a1db00;">if</span> <span style="color: #d18aff;">__name__</span> == <span style="color: #ff4ea3;">'__main__'</span>:
         hello()
         <span style="color: #a1db00;">print</span> hello.<span style="color: #d18aff;">__name__</span>
         <span style="color: #a1db00;">print</span> hello.<span style="color: #d18aff;">__doc__</span>

         <span style="color: #a1db00;">print</span>
         hello2()
         <span style="color: #a1db00;">print</span> hello2.<span style="color: #d18aff;">__name__</span>
         <span style="color: #a1db00;">print</span> hello2.<span style="color: #d18aff;">__doc__</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org36c9a13" class="outline-2">
<h2 id="org36c9a13"><span class="section-number-2">3</span> cmp_to_key</h2>
<div class="outline-text-2" id="text-3">
<p>
对于python 2.X，支持一种叫 <code>cmp</code> 函数来排序：
</p>
<pre class="example">
     &gt;&gt;&gt; def numeric_compare(x, y):
     ...     return x - y
     &gt;&gt;&gt; sorted([5, 2, 4, 1, 3], cmp=numeric_compare) 
     [1, 2, 3, 4, 5]

     Or you can reverse the order of comparison with:

     &gt;&gt;&gt; def reverse_numeric(x, y):
     ...     return y - x
     &gt;&gt;&gt; sorted([5, 2, 4, 1, 3], cmp=reverse_numeric) 
     [5, 4, 3, 2, 1]
</pre>

<p>
python 2.4之后<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>，包括python 3都支持一种 <code>key</code> 的函数来
排序：
</p>
<pre class="example">
     &gt;&gt;&gt; sorted("This is a test string from Andrew".split(), key=str.lower)
     ['a', 'Andrew', 'from', 'is', 'string', 'test', 'This']

     &gt;&gt;&gt; student_tuples = [
     ...     ('john', 'A', 15),
     ...     ('jane', 'B', 12),
     ...     ('dave', 'B', 10),
     ... ]
     &gt;&gt;&gt; sorted(student_tuples, key=lambda student: student[2])   # sort by age
     [('dave', 'B', 10), ('jane', 'B', 12), ('john', 'A', 15)]
</pre>
<p>
但是在python 3的时候，为了代码的简化，删除了sorted对于 <code>cmd</code> 函数的
支持。所以对于python 3来说，可以使用 <code>functools.cmp_to_key()</code> 来把
一个 <code>cmd</code> 函数转为一个 <code>key</code> 函数。
</p>
</div>
</div>

<div id="outline-container-org536d605" class="outline-2">
<h2 id="org536d605"><span class="section-number-2">4</span> total_ordering</h2>
<div class="outline-text-2" id="text-4">
<p>
一个class如果自定义比较函数的一个或者几个，这个装钸器可以帮你定义其
它的。但是注意：
</p>
<pre class="example">
     The class must define one of __lt__(), __le__(), __gt__(), or 
     __ge__(). In addition, the class should supply an __eq__()
     method.

     For example:

     @total_ordering
     class Student:
         def __eq__(self, other):
             return ((self.lastname.lower(), self.firstname.lower()) ==
                     (other.lastname.lower(), other.firstname.lower()))
         def __lt__(self, other):
             return ((self.lastname.lower(), self.firstname.lower()) &lt;
                     (other.lastname.lower(), other.firstname.lower()))
</pre>

<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> total_ordering
     <span style="color: #00d7af;">@total_ordering</span>
     <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Student</span>:
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, firstname, lastname):
             <span style="color: #a1db00;">self</span>.firstname = firstname
             <span style="color: #a1db00;">self</span>.lastname = lastname

         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__eq__</span>(<span style="color: #a1db00;">self</span>, other):
             <span style="color: #a1db00;">return</span> ((<span style="color: #a1db00;">self</span>.lastname.lower(), <span style="color: #a1db00;">self</span>.firstname.lower()) ==
                     (other.lastname.lower(), other.firstname.lower()))

         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__lt__</span>(<span style="color: #a1db00;">self</span>, other):
             <span style="color: #a1db00;">return</span> ((<span style="color: #a1db00;">self</span>.lastname.lower(), <span style="color: #a1db00;">self</span>.firstname.lower()) &lt;
                     (other.lastname.lower(), other.firstname.lower()))

     <span style="color: #ff8700;">a</span> = Student(<span style="color: #ff4ea3;">'A'</span>, <span style="color: #ff4ea3;">'C'</span>)
     <span style="color: #ff8700;">b</span> = Student(<span style="color: #ff4ea3;">'b'</span>, <span style="color: #ff4ea3;">'d'</span>)
     <span style="color: #ff8700;">c</span> = Student(<span style="color: #ff4ea3;">'b'</span>, <span style="color: #ff4ea3;">'c'</span>)
     <span style="color: #ff8700;">d</span> = Student(<span style="color: #ff4ea3;">'b'</span>, <span style="color: #ff4ea3;">'c'</span>)


     <span style="color: #a1db00;">print</span> a &gt; b
     <span style="color: #a1db00;">print</span> a &lt;= b
     <span style="color: #a1db00;">print</span> d &gt;= c

</pre>
</div>

<p>
感觉amazing。
</p>
</div>
</div>
<div id="outline-container-org493a360" class="outline-2">
<h2 id="org493a360"><span class="section-number-2">5</span> wraps</h2>
<div class="outline-text-2" id="text-5">
<p>
它是 <a href="#update_wrapper">update_wrapper</a> 的一个更加方便的形式，可以这样使用：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> wraps
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">my_decorator</span>(f):
        <span style="color: #00d7af;">@wraps</span>(f)
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">wrapper</span>(*args, **kwds):
            <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'Calling decorated function'</span>
            <span style="color: #a1db00;">return</span> f(*args, **kwds)
        <span style="color: #a1db00;">return</span> wrapper

    <span style="color: #00d7af;">@my_decorator</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">example</span>():
        <span style="color: #ff4b4b;">"""Docstring"""</span>
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'Called example function'</span>

    example()
    <span style="color: #a1db00;">print</span> example.<span style="color: #d18aff;">__name__</span>
    <span style="color: #a1db00;">print</span> example.<span style="color: #d18aff;">__doc__</span>
</pre>
</div>

<p>
可以看到，函数的name还是原来定义的，而不是里面wrapper函数的内容。
</p>
</div>
</div>

<div id="outline-container-org3f01ecd" class="outline-2">
<h2 id="org3f01ecd"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> partial创建的对象 <a href="#orge35b74b">暂时没有找到合适的例子</a></h2>
<div class="outline-text-2" id="text-6">
<p>
partial对象是在调用 <code>partial()</code> 函数后就创建的，它们有下面这三种只读
的属性：
</p>
<ol class="org-ol">
<li>partial.func ：这一定是一个可以被调用的对象或者函数，对partial对
象的调用实际就是调用它。</li>
<li>partial.args ：定义partial函数时所有最左边的不是赋值的参数</li>
<li>partial.keywords ：定义partial函数时所有赋值传进来的参数</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> partial

    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add</span>(x, y, name=<span style="color: #5fafd7;">None</span>):
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'result = %s'</span> % (x + y)

    <span style="color: #ff8700;">plus</span> = partial(add, 3, 4, name=<span style="color: #ff4ea3;">'test'</span>)

    <span style="color: #a1db00;">print</span> add
    <span style="color: #a1db00;">print</span> plus

    <span style="color: #a1db00;">print</span> plus.func
    <span style="color: #a1db00;">print</span> plus.args
    <span style="color: #a1db00;">print</span> plus.keywords
    plus()

</pre>
</div>

<p>
partial对象和函数对象差不多：能被调用，弱引用的，可以有属性。不过也
有一些重要的区别：
</p>
<ol class="org-ol">
<li><p>
没有 <code>__name__</code> 和 <code>__doc__</code> 属性。
</p>
<div class="org-src-container">
<pre class="src src-python">       <span style="color: #a1db00;">from</span> functools <span style="color: #a1db00;">import</span> partial

       <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add</span>(x, y, name=<span style="color: #5fafd7;">None</span>):
           <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'result = %s'</span> % (x + y)

       <span style="color: #ff8700;">plus</span> = partial(add, 3, 4, name=<span style="color: #ff4ea3;">'test'</span>)

       <span style="color: #a1db00;">print</span> plus.<span style="color: #d18aff;">__name__</span>
       <span style="color: #a1db00;">print</span> plus.<span style="color: #d18aff;">__doc__</span>
</pre>
</div></li>

<li>在类中定义的partial对象有点象静态方法，它在实例属性查询期间，不能
转换为绑定的方法。 <a id="orge35b74b"></a> 。</li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">之前的版本，没有内置的sorted函数，list.sort()函
数也不能接收key argument。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>